data/Parm_PH_29/alpha_10/alpha_10_9000_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0400330677499857 1.00078219360891 -5.63518249810207e-18)
(0.120107357913487 0.999796740285219 0)
(0.199933300416749 0.993789555448245 8.60191188462889e-18)
(0.278266843916536 0.977842791337529 0)
(0.353016182699265 0.949666402369621 2.40164676404661e-17)
(0.423020239000242 0.911003200121656 2.21783774654429e-17)
(0.489004067888648 0.865754325270188 0)
(0.552243562211276 0.816751516570405 7.5265257111591e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0400380308287192 1 0)
(0.120091432314613 0.999013374143257 0)
(0.199802785076396 0.993013179579146 0)
(0.27797179055355 0.977107727124725 0)
(0.352561181409551 0.949014702829256 0)
(0.422485814336024 0.910395842168583 0)
(0.488447664364186 0.865121480646175 0)
(0.551690440051809 0.81604002000439 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0375 2.024 0)
(0.1125 2.024 0)
(0.1875 2.024 0)
(0.2625 2.024 0)
(0.3375 2.024 0)
(0.4125 2.024 0)
(0.4875 2.024 0)
(0.5625 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
