data/Parm_PH_29/alpha_10/alpha_10_9000_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.01537941 -0.00023992 0.00000000 0.00008534 0.00000000 0.00901399)
(0.01930498 -0.00015725 0.00000000 0.00003838 0.00000000 0.01152529)
(0.00114968 -0.00026086 0.00000000 0.00009633 0.00000000 0.00069890)
(0.00405532 -0.00047841 0.00000000 -0.00009071 0.00000000 0.00328612)
(0.00168183 -0.00115446 0.00000000 0.00082591 0.00000000 0.00398957)
(0.00131224 -0.00056591 0.00000000 0.00035597 0.00000000 0.00128612)
(0.00506807 -0.00394715 0.00000000 0.00307807 0.00000000 0.00721586)
(0.00445373 -0.00340410 0.00000000 0.00267819 0.00000000 0.00595793)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
